tutorials/lagrangian/reactingParcelFoam/airRecirculationRoom/steady/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "(roof|floor|sideWall|humanBody)"
    {
        type            zeroGradient;
    }

    "(inlet|mouth)"
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           $internalField;
    }

    "(intake1|intake2|intake3|intake4)"
    {
        type            fixedValue;
        value           $internalField;
    }

    "(exhaust_maxX|exhaust_minX|exhaust_maxY|exhaust_minY)"
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
